docs/blog/posts/pseudoprimes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-25 Thu 19:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pseudoprimes</title>
<meta name="author" content="Noelle Crawford" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Pseudoprimes
<br />
<span class="subtitle">The Imperfections Primality Testing</span>
</h1>
<div id="outline-container-org9ba9eca" class="outline-2">
<h2 id="org9ba9eca">Background</h2>
<div class="outline-text-2" id="text-org9ba9eca">
<p>
A number \[p\] is prime iff \[\forall x\] such that \[x \mid p\], either \[x = 1\] or \[x = p\].
</p>

<p>
Given a number, how would you check if it's prime? The simplist answer is to factor it. For all known prime numbers less than <i>n</i>, ...
But what if <i>n</i> is big? Take XXXX for example. To store all prime numbers less than XXXX would take XXX GB of space, ....
You could generate numbers on the fly, a modern computer could likely spare the space during computation, if it's not being used for much else, but that would take quite a while. 
</p>

<p>
The thing is, modern cryptography relies on prime numbers, and in many cases, these numbers cannot be constantly re-used. That means, we need to be able to generate, or at least check that numbers are prime on the fly.
</p>

<p>
So researchers have come up with probabalistic primality tests which pass <i>much</i> more often on prime numbers than composite. When <i>much</i> is big enough, this means we can be relatively sure numbers are prime
</p>
</div>
</div>
<div id="outline-container-orgeebd9a5" class="outline-2">
<h2 id="orgeebd9a5">Primality Testing</h2>
<div class="outline-text-2" id="text-orgeebd9a5">
</div>
<div id="outline-container-orgef63279" class="outline-3">
<h3 id="orgef63279">Fermat Test</h3>
<div class="outline-text-3" id="text-orgef63279">
</div>
<div id="outline-container-org4f016b7" class="outline-4">
<h4 id="org4f016b7">Fermat's Little Therom</h4>
</div>
</div>
<div id="outline-container-orgd8afda4" class="outline-3">
<h3 id="orgd8afda4">Miller-Rabin Test</h3>
</div>
<div id="outline-container-org658c309" class="outline-3">
<h3 id="org658c309">Lucas Test</h3>
</div>
<div id="outline-container-org71d7b96" class="outline-3">
<h3 id="org71d7b96">Baille-PSW</h3>
</div>
</div>
<div id="outline-container-orgffc7f92" class="outline-2">
<h2 id="orgffc7f92">Pseudoprime Construction</h2>
<div class="outline-text-2" id="text-orgffc7f92">
<p>
The following is taken from this paper (link Primes and Prejudice)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Noelle Crawford</p>
<p class="date">Created: 2025-09-25 Thu 19:07</p>
</div>
</body>
</html>
